{
  "Order": 3,
  "Title": "Code of conduct",
  "Html": "<section id=\"section-1248482402\">\r\n                <h1 class=\"m-heading text-h3 text-sm-h3 mb-2\">\r\n                    <a class=\"text-decoration-none text-right text-md-left\">#</a>\r\n                    Code of conduct\r\n                </h1>\n<p>If you have questions or concerns about our Code of Conduct, please contact us <a href=\"\">opensource@masastack.com</a>.</p>\n\r\n            <div class=\"mb-8\">&nbsp;</div><section id=section-777597002>\r\n                <h2 class=\"m-heading text-h4 text-sm-h4 mb-3\">\r\n                    <a class=\"text-decoration-none text-right text-md-left\">#</a>\r\n                    Our Standards\r\n                </h2>\n<p>Examples of behavior that contributes to creating a positive environment include:</p>\n<ul>\n<li>Using welcoming and inclusive language</li>\n<li>Being respectful of differing viewpoints and experiences</li>\n<li>Gracefully accepting constructive criticism</li>\n<li>Focusing on what is best for the community</li>\n<li>Showing empathy towards other community members</li>\n</ul>\n<p>Examples of unacceptable behavior by participants include:</p>\n<ul>\n<li>The use of sexualized language or imagery and unwelcome sexual attention or advances</li>\n<li>Trolling, insulting/derogatory comments, and personal or political attacks</li>\n<li>Public or private harassment</li>\n<li>Publishing others’ private information, such as a physical or electronic address, without explicit permission</li>\n<li>Other conduct which could reasonably be considered inappropriate in a professional setting</li>\n</ul>\n<br>\n\r\n            </section><section id=section-2075130716>\r\n                <h2 class=\"m-heading text-h4 text-sm-h4 mb-3\">\r\n                    <a class=\"text-decoration-none text-right text-md-left\">#</a>\r\n                    Our Responsibilities\r\n                </h2>\n<p>Project maintainers are responsible for clarifying the standards of acceptable behavior and are expected to take appropriate and fair corrective action in response to any instances of unacceptable behavior.\n<br></p>\n<p>Project maintainers have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code of Conduct, or to ban temporarily or permanently any contributor for other behaviors that they deem inappropriate, threatening, offensive, or harmful.</p>\n<br>\n\r\n            </section><section id=section-1879716848>\r\n                <h2 class=\"m-heading text-h4 text-sm-h4 mb-3\">\r\n                    <a class=\"text-decoration-none text-right text-md-left\">#</a>\r\n                    Scope\r\n                </h2>\n<p>This Code of Conduct applies both within project spaces and in public spaces when an individual is representing the project or its community. Examples of representing a project or community include using an official project e-mail address, posting via an official social media account, or acting as an appointed representative at an online or offline event. Representation of a project may be further defined and clarified by project maintainers.</p>\n<br>\n\r\n            </section><section id=section-292134780>\r\n                <h2 class=\"m-heading text-h4 text-sm-h4 mb-3\">\r\n                    <a class=\"text-decoration-none text-right text-md-left\">#</a>\r\n                    Enforcement\r\n                </h2>\n<p>Instances of abusive, harassing, or otherwise unacceptable behavior may be reported by contacting the project team at <a href=\"\">opensource@masastack.com</a>. The project team will review and investigate all complaints, and will respond in a way that it deems appropriate to the circumstances. The project team is obligated to maintain confidentiality with regard to the reporter of an incident. Further details of specific enforcement policies may be posted separately.</p>\n<br>\n<p>Project maintainers who do not follow or enforce the Code of Conduct in good faith may face temporary or permanent repercussions as determined by other members of the project’s leadership.</p>\n<br>\n\r\n            </section><section id=section-1984097011>\r\n                <h2 class=\"m-heading text-h4 text-sm-h4 mb-3\">\r\n                    <a class=\"text-decoration-none text-right text-md-left\">#</a>\r\n                    Attribution\r\n                </h2>\n<p>This Code of Conduct is adapted from the Contributor Covenant, version 1.4, available at https://contributor-covenant.org/version/1/4</p>\n</section>"
}