{
  "Order": 2,
  "Title": "Security disclosure",
  "Html": "<section id=\"section-1743191765\">\r\n                <h1 class=\"m-heading text-h3 text-sm-h3 mb-2\">\r\n                    <a class=\"text-decoration-none text-right text-md-left\">#</a>\r\n                    Security disclosure\r\n                </h1>\n<p>This document outlines the safety procedures and general policies of the MASA Blazor project.</p>\n\r\n            <div class=\"mb-8\">&nbsp;</div><section id=section-1286244968>\r\n                <h2 class=\"m-heading text-h4 text-sm-h4 mb-3\">\r\n                    <a class=\"text-decoration-none text-right text-md-left\">#</a>\r\n                    Report error\r\n                </h2>\n<p>The MASA Blazor team and community take all security vulnerabilities in MASA Blazor seriously. We appreciate your efforts and responsible disclosure, and will make every effort to recognize your contribution.</p>\n<p>To report a security issue, please email <a href=\"\">opensource@masastack.com</a> and include the word &quot;SECURITY&quot; in the subject line</p>\n<p>The MASA Blazor team will send a response explaining the next steps in processing your report. The MASA Blazor team will send a response explaining the next steps in processing your report. After an initial response to your report, the security team will keep you informed of the progress of the repair and the complete announcement, and may ask you to provide additional information or guidance.</p>\n<br>\n\r\n            </section><section id=section-1000666677>\r\n                <h2 class=\"m-heading text-h4 text-sm-h4 mb-3\">\r\n                    <a class=\"text-decoration-none text-right text-md-left\">#</a>\r\n                    Disclosure policy\r\n                </h2>\n<p>When the security team receives a security vulnerability report, they will assign it to a primary processor. This person will coordinate the repair and release procedures, involving the following steps:</p>\n<ul>\n<li>Identify the problem and determine the affected version.</li>\n<li>Audit the code to discover any potential similar issues.</li>\n<li>Prepare fixes for all versions that are still under maintenance. These fixes will be published as soon as possible.</li>\n</ul>\n<br>\n\r\n            </section><section id=section-2086107424>\r\n                <h2 class=\"m-heading text-h4 text-sm-h4 mb-3\">\r\n                    <a class=\"text-decoration-none text-right text-md-left\">#</a>\r\n                    Suggestions for this policy\r\n                </h2>\n<p>If you have suggestions on how to improve this process, please submit using <a href=\"https://github.com/BlazorComponent/Masa.Blazor/issues\" target=\"_blank\">issue</a>.</p>\n</section>"
}