{
  "props": {
    "allowOverflow": "Removes overflow re-positioning for the content",
    "attach": "Specifies which DOM element that this component should detach to.String can be any valid querySelector and Object can be any valid Node. This will attach to the root (MApp)[/components/apps] component by default.",
    "auto": "Centers list on selected element",
    "closeOnClick": "Designates if menu should close on outside-activator click",
    "closeOnContentClick": "Designates if menu should close when its content is clicked",
    "contentClass": "Applies a custom class to the detached element. This is useful because the content is moved to the beginning of the (MApp)[/components/apps] component (unless the `Attach` prop is provided) and is not targettable by classes passed directly on the component.",
    "contentStyle": "",
    "disableKeys": "Removes all keyboard interaction",
    "disabled": "Disables the menu",
    "externalActivator": "Detaches the menu content inside of the component as opposed to the document.",
    "nudgeBottom": "Nudge the content to the bottom",
    "nudgeLeft": "Nudge the content to the left",
    "nudgeRight": "Nudge the content to the right",
    "nudgeTop": "Nudge the content to the top",
    "nudgeWidth": "Nudge the content width",
    "offsetOverflow": "Causes the component to flip to the opposite side when repositioned due to overflow",
    "offsetX": "Offset the menu on the x-axis. Works in conjunction with direction left/right",
    "offsetY": "Offset the menu on the y-axis. Works in conjunction with direction top/bottom",
    "openDelay": "Milliseconds to wait before opening component. Only works with the `OpenOnHover` prop",
    "openOnClick": "Designates whether menu should open on activator click",
    "openOnFocus": "Specifies whether to open the menu when the cursor is selected",
    "openOnHover": "Designates whether menu should open on activator hover",
    "origin": "Sets the transition origin on the element. You can find more information on the MDN documentation (for transition origin)[https://developer.mozilla.org/en-US/docs/Web/CSS/transform-origin].",
    "positionX": "Used to position the content when not using an activator slot",
    "positionY": "Used to position the content when not using an activator slot",
    "transition": "Sets the component transition. Can be one of the [built in transitions](/blazor/styles-and-animations/transitions) or one your own.",
    "value": "Controls whether the component is visible or hidden.",
    "zIndex": "The z-index used for the component"
  },
  "events": {
    "onOutsideClick": ""
  },
  "contents": {
    "activatorContent": ""
  }
}